t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_sysctl.h
//###########################################################################
//
// FILE:    hw_sysctl.h
//
// TITLE:   Definitions for the SYSCTL registers.
//
//###########################################################################
// 
// C2000Ware v6.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_SYSCTL_H
#define HW_SYSCTL_H

//*************************************************************************************************
//
// The following are defines for the SYSCTL register offsets
//
//*************************************************************************************************
#define SYSCTL_O_DEVCFGLOCK1   0x0U     // Lock bit for CPUSELx registers
#define SYSCTL_O_DEVCFGLOCK2   0x2U     // Lock bit for DEVCFG registers
#define SYSCTL_O_PARTIDL       0x8U     // Lower 32-bit of Device PART Identification Number
#define SYSCTL_O_PARTIDH       0xAU     // Upper 32-bit of Device PART Identification Number
#define SYSCTL_O_REVID         0xCU     // Device Revision Number
#define SYSCTL_O_BANKMUXSEL    0x60U    // Flash Bank allocation to CPU. Internal note : This
                                        // register is accessible (read-only) by CPU2, for devices
                                        // with CPU2
#define SYSCTL_O_MCUCNF0       0x78U    // MCU Configuration register for DC0.DUAL_CORE
#define SYSCTL_O_MCUCNF1       0x7AU    // MCU Configuration register for LockStep Feature on
                                        // device
#define SYSCTL_O_MCUCNF2       0x7CU    // MCU Configuration register for EtherCAT
#define SYSCTL_O_MCUCNF3       0x7EU    // MCU Configuration register for Flash Bank 1
#define SYSCTL_O_MCUCNF4       0x80U    // MCU Configuration register for Flash Bank 2
#define SYSCTL_O_MCUCNF5       0x82U    // MCU Configuration register for Flash Bank 3
#define SYSCTL_O_MCUCNF6       0x84U    // MCU Configuration register for Flash Bank 4
#define SYSCTL_O_MCUCNF7       0x86U    // MCU Configuration register for Flash Bank 5
#define SYSCTL_O_MCUCNFLOCK    0x8CU    // Lock bit for MCUCNFx registers
#define SYSCTL_O_TRIMERRSTS    0x8EU    // TRIM Error Status register
#define SYSCTL_O_SOFTPRES0     0x9CU    // Processing Block Software Reset register
#define SYSCTL_O_SOFTPRES1     0x9EU    // EMIF Software Reset register
#define SYSCTL_O_SOFTPRES2     0xA0U    // EPWM Software Reset register
#define SYSCTL_O_SOFTPRES3     0xA2U    // ECAP Software Reset register
#define SYSCTL_O_SOFTPRES4     0xA4U    // EQEP Software Reset register
#define SYSCTL_O_SOFTPRES6     0xA8U    // Sigma Delta Software Reset register
#define SYSCTL_O_SOFTPRES7     0xAAU    // SCI, UART Software Reset register
#define SYSCTL_O_SOFTPRES8     0xACU    // SPI Software Reset register
#define SYSCTL_O_SOFTPRES9     0xAEU    // I2C Software Reset register
#define SYSCTL_O_SOFTPRES10    0xB0U    // CAN Software Reset register
#define SYSCTL_O_SOFTPRES11    0xB2U    // McBSP/USB Software Reset register
#define SYSCTL_O_SOFTPRES13    0xB6U    // ADC Software Reset register
#define SYSCTL_O_SOFTPRES14    0xB8U    // CMPSS Software Reset register
#define SYSCTL_O_SOFTPRES16    0xBCU    // DAC Software Reset register
#define SYSCTL_O_SOFTPRES17    0xBEU    // CLB Software Reset register
#define SYSCTL_O_SOFTPRES18    0xC0U    // FSI Software Reset register
#define SYSCTL_O_SOFTPRES19    0xC2U    // LIN Software Reset register
#define SYSCTL_O_SOFTPRES21    0xC6U    // DCC Software Reset register
#define SYSCTL_O_SOFTPRES23    0xCAU    // ETHERCAT Software Reset register
#define SYSCTL_O_SOFTPRES26    0xD0U    // AES Software Reset register
#define SYSCTL_O_SOFTPRES27    0xD2U    // EPG Software Reset register
#define SYSCTL_O_SOFTPRES28    0xD4U    // Flash Software Reset register
#define SYSCTL_O_SOFTPRES29    0xD6U    // ADCCHECKER Software Reset register
#define SYSCTL_O_SOFTPRES40    0xECU    // Peripheral Software Reset register
#define SYSCTL_O_CPUSEL0       0xF0U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL1       0xF2U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL2       0xF4U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL3       0xF6U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL4       0xF8U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL5       0xFAU    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL6       0xFCU    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL7       0xFEU    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL8       0x100U   // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL9       0x102U   // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL11      0x106U   // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL12      0x108U   // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL13      0x10AU   // CPU select register for DCC
#define SYSCTL_O_CPUSEL14      0x10CU   // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL15      0x10EU   // CPU select register for CLB tiles
#define SYSCTL_O_CPUSEL16      0x110U   // CPU select register for FSI
#define SYSCTL_O_CPUSEL17      0x112U   // CPU select register for LIN
#define SYSCTL_O_CPUSEL23      0x11EU   // CPU select register for EtherCAT
#define SYSCTL_O_CPUSEL25      0x122U   // CPU select register for HRCAL
#define SYSCTL_O_CPUSEL26      0x124U   // CPU select register for AES
#define SYSCTL_O_CPUSEL27      0x126U   // CPU select register for EPG
#define SYSCTL_O_CPUSEL28      0x128U   // CPU select register for ADCCHECKER tiles
#define SYSCTL_O_CPU2RESCTL    0x13CU   // CPU2 Reset Control Register
#define SYSCTL_O_RSTSTAT       0x13EU   // Reset Status register for secondary C28x CPUs
#define SYSCTL_O_LPMSTAT       0x13FU   // LPM Status Register for secondary C28x CPUs
#define SYSCTL_O_TAP_STATUS    0x14AU   // Status of JTAG State machine & Debugger Connect
#define SYSCTL_O_TAP_CONTROL   0x14CU   // Disable TAP control
#define SYSCTL_O_USBTYPE       0x1D2U   // Configures USB Type for the device
#define SYSCTL_O_ECAPTYPE      0x1D3U   // Configures ECAP Type for the device
#define SYSCTL_O_SDFMTYPE      0x1D4U   // Configures SDFM Type for the device
#define SYSCTL_O_MEMMAPTYPE    0x1D6U   // Configures Memory Map Type for the device

