t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_sysctl.h
#define SYSCTL_O_CLKSEM           0x0U    // Clock Control Semaphore Register
#define SYSCTL_O_CLKCFGLOCK1      0x2U    // Lock bit for CLKCFG registers
#define SYSCTL_O_CLKSRCCTL1       0x8U    // Clock Source Control register-1
#define SYSCTL_O_CLKSRCCTL2       0xAU    // Clock Source Control register-2
#define SYSCTL_O_CLKSRCCTL3       0xCU    // Clock Source Control register-3
#define SYSCTL_O_SYSPLLCTL1       0xEU    // SYSPLL Control register-1
#define SYSCTL_O_SYSPLLMULT       0x14U   // SYSPLL Multiplier register
#define SYSCTL_O_SYSPLLSTS        0x16U   // SYSPLL Status register
#define SYSCTL_O_AUXPLLCTL1       0x18U   // AUXPLL Control register-1
#define SYSCTL_O_AUXPLLMULT       0x1EU   // AUXPLL Multiplier register
#define SYSCTL_O_AUXPLLSTS        0x20U   // AUXPLL Status register
#define SYSCTL_O_SYSCLKDIVSEL     0x22U   // System Clock Divider Select register
#define SYSCTL_O_AUXCLKDIVSEL     0x24U   // Auxillary Clock Divider Select register
#define SYSCTL_O_PERCLKDIVSEL     0x26U   // Peripheral Clock Divider Select register
#define SYSCTL_O_XCLKOUTDIVSEL    0x28U   // XCLKOUT Divider Select register
#define SYSCTL_O_CLBCLKCTL        0x2AU   // CLB Clocking Control Register
#define SYSCTL_O_LOSPCP           0x2CU   // Low Speed Clock Source Prescalar
#define SYSCTL_O_MCDCR            0x2EU   // Missing Clock Detect Control Register
#define SYSCTL_O_X1CNT            0x30U   // 10-bit Counter on X1 Clock
#define SYSCTL_O_XTALCR           0x32U   // XTAL Control Register
#define SYSCTL_O_XTALCR2          0x3AU   // XTAL Control Register for pad init
#define SYSCTL_O_CLKFAILCFG       0x3CU   // Clock Fail cause Configuration
#define SYSCTL_O_ETHERCATCLKCTL   0x40U   // EtherCAT Clock Control
#define SYSCTL_O_SYNCBUSY         0x42U   // Pulse Transfer Sync Busy Status register

#define SYSCTL_O_CPUSYSLOCK1          0x0U    // Lock bit for CPUSYS registers
#define SYSCTL_O_CPUSYSLOCK2          0x2U    // Lock bit for CPUSYS registers
#define SYSCTL_O_PIEVERRADDR          0xAU    // PIE Vector Fetch Error Address register
#define SYSCTL_O_ETHERCATCTL          0xCU    // ETHERCAT control register.
#define SYSCTL_O_PCLKCR0              0x10U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR1              0x12U   // Peripheral Clock Gating Register - EMIF
#define SYSCTL_O_PCLKCR2              0x14U   // Peripheral Clock Gating Register - ETPWM
#define SYSCTL_O_PCLKCR3              0x16U   // Peripheral Clock Gating Register - ECAP
#define SYSCTL_O_PCLKCR4              0x18U   // Peripheral Clock Gating Register - EQEP
#define SYSCTL_O_PCLKCR6              0x1CU   // Peripheral Clock Gating Register - SDFM
#define SYSCTL_O_PCLKCR7              0x1EU   // Peripheral Clock Gating Register - SCI, UART
#define SYSCTL_O_PCLKCR8              0x20U   // Peripheral Clock Gating Register - SPI
#define SYSCTL_O_PCLKCR9              0x22U   // Peripheral Clock Gating Register - I2C, PMBUS
#define SYSCTL_O_PCLKCR10             0x24U   // Peripheral Clock Gating Register - CAN
#define SYSCTL_O_PCLKCR11             0x26U   // Peripheral Clock Gating Register - McBSP_USB
#define SYSCTL_O_PCLKCR13             0x2AU   // Peripheral Clock Gating Register - ADC
#define SYSCTL_O_PCLKCR14             0x2CU   // Peripheral Clock Gating Register - CMPSS
#define SYSCTL_O_PCLKCR16             0x30U   // Peripheral Clock Gating Register Buf_DAC
#define SYSCTL_O_PCLKCR17             0x32U   // Peripheral Clock Gating Register - CLB
#define SYSCTL_O_PCLKCR18             0x34U   // Peripheral Clock Gating Register - FSI
#define SYSCTL_O_PCLKCR19             0x36U   // Peripheral Clock Gating Register - LIN
#define SYSCTL_O_PCLKCR21             0x3AU   // Peripheral Clock Gating Register - DCC
#define SYSCTL_O_PCLKCR23             0x3EU   // Peripheral Clock Gating Register - EtherCAT
#define SYSCTL_O_PCLKCR25             0x42U   // Peripheral Clock Gating Register - HRCAL0,1,2
#define SYSCTL_O_PCLKCR26             0x44U   // Peripheral Clock Gating Register - AES
#define SYSCTL_O_PCLKCR27             0x46U   // Peripheral Clock Gating Register - EPG
#define SYSCTL_O_PCLKCR28             0x48U   // Peripheral Clock Gating Register - ADCCHECKER
#define SYSCTL_O_SIMRESET             0x60U   // Simulated Reset Register
#define SYSCTL_O_LPMCR                0x66U   // LPM Control Register
#define SYSCTL_O_CPUID                0x68U   // Indicates CPU1 or CPU2
#define SYSCTL_O_CMPSSLPMSEL          0x6CU   // CMPSS LPM Wakeup select registers
#define SYSCTL_O_GPIOLPMSEL0          0x6EU   // GPIO LPM Wakeup select registers
#define SYSCTL_O_GPIOLPMSEL1          0x70U   // GPIO LPM Wakeup select registers
#define SYSCTL_O_TMR2CLKCTL           0x72U   // Timer2 Clock Measurement functionality control
                                              // register
#define SYSCTL_O_RESCCLR              0x74U   // Reset Cause Clear Register
#define SYSCTL_O_RESC                 0x76U   // Reset Cause register
#define SYSCTL_O_MCANWAKESTATUS       0x8EU   // MCAN Wake Status Register
#define SYSCTL_O_MCANWAKESTATUSCLR    0x90U   // MCAN Wake Status Clear Register
#define SYSCTL_O_CLKSTOPREQ           0x92U   // Peripheral Clock Stop Request Register
#define SYSCTL_O_CLKSTOPACK           0x94U   // Peripheral Clock Stop Ackonwledge Register
#define SYSCTL_O_USER_REG1_SYSRSN     0x96U   // Software Configurable registers reset by SYSRSn
#define SYSCTL_O_USER_REG2_SYSRSN     0x98U   // Software Configurable registers reset by SYSRSn
#define SYSCTL_O_USER_REG1_XRSN       0x9AU   // Software Configurable registers reset by XRSn
#define SYSCTL_O_USER_REG2_XRSN       0x9CU   // Software Configurable registers reset by XRSn
#define SYSCTL_O_USER_REG1_PORESETN   0x9EU   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG2_PORESETN   0xA0U   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG3_PORESETN   0xA2U   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG4_PORESETN   0xA4U   // Software Configurable registers reset by PORESETn

