t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_sysctl.h
#define SYSCTL_O_LSEN                 0x6AU   // Lockstep enable configuration

#define SYSCTL_O_SCSR         0x22U   // System Control & Status Register
#define SYSCTL_O_WDCNTR       0x23U   // Watchdog Counter Register
#define SYSCTL_O_WDKEY        0x25U   // Watchdog Reset Key Register
#define SYSCTL_O_SYNCBUSYWD   0x28U   // SYNCBUSY status for Watchdog Register
#define SYSCTL_O_WDCR         0x29U   // Watchdog Control Register
#define SYSCTL_O_WDWCR        0x2AU   // Watchdog Windowed Control Register

#define SYSCTL_O_CLA1TASKSRCSELLOCK   0x0U    // CLA1 Task Trigger Source Select Lock Register
#define SYSCTL_O_DMACHSRCSELLOCK      0x4U    // DMA Channel Triger Source Select Lock Register
#define SYSCTL_O_CLA1TASKSRCSEL1      0x6U    // CLA1 Task Trigger Source Select Register-1
#define SYSCTL_O_CLA1TASKSRCSEL2      0x8U    // CLA1 Task Trigger Source Select Register-2
#define SYSCTL_O_DMACHSRCSEL1         0x16U   // DMA Channel Trigger Source Select Register-1
#define SYSCTL_O_DMACHSRCSEL2         0x18U   // DMA Channel Trigger Source Select Register-2

#define SYSCTL_O_DMACHSRCSELLOCK   0x4U    // DMA Channel Triger Source Select Lock Register
#define SYSCTL_O_DMACHSRCSEL1      0x16U   // DMA Channel Trigger Source Select Register-1
#define SYSCTL_O_DMACHSRCSEL2      0x18U   // DMA Channel Trigger Source Select Register-2

#define SYSCTL_O_ADCA_AC          0x0U     // ADCA Controller Access Control Register
#define SYSCTL_O_ADCB_AC          0x2U     // ADCB Controller Access Control Register
#define SYSCTL_O_ADCC_AC          0x4U     // ADCC Controller Access Control Register
#define SYSCTL_O_CMPSS1_AC        0x10U    // CMPSS1 Controller Access Control Register
#define SYSCTL_O_CMPSS2_AC        0x12U    // CMPSS2 Controller Access Control Register
#define SYSCTL_O_CMPSS3_AC        0x14U    // CMPSS3 Controller Access Control Register
#define SYSCTL_O_CMPSS4_AC        0x16U    // CMPSS4 Controller Access Control Register
#define SYSCTL_O_CMPSS5_AC        0x18U    // CMPSS5 Controller Access Control Register
#define SYSCTL_O_CMPSS6_AC        0x1AU    // CMPSS6 Controller Access Control Register
#define SYSCTL_O_CMPSS7_AC        0x1CU    // CMPSS7 Controller Access Control Register
#define SYSCTL_O_CMPSS8_AC        0x1EU    // CMPSS8 Controller Access Control Register
#define SYSCTL_O_CMPSS9_AC        0x20U    // CMPSS9 Controller Access Control Register
#define SYSCTL_O_CMPSS10_AC       0x22U    // CMPSS10 Controller Access Control Register
#define SYSCTL_O_CMPSS11_AC       0x24U    // CMPSS11 Controller Access Control Register
#define SYSCTL_O_DACA_AC          0x28U    // DACA Controller Access Control Register
#define SYSCTL_O_DACC_AC          0x2CU    // DACC Controller Access Control Register
#define SYSCTL_O_EPWM1_AC         0x48U    // EPWM1 Controller Access Control Register
#define SYSCTL_O_EPWM2_AC         0x4AU    // EPWM2 Controller Access Control Register
#define SYSCTL_O_EPWM3_AC         0x4CU    // EPWM3 Controller Access Control Register
#define SYSCTL_O_EPWM4_AC         0x4EU    // EPWM4 Controller Access Control Register
#define SYSCTL_O_EPWM5_AC         0x50U    // EPWM5 Controller Access Control Register
#define SYSCTL_O_EPWM6_AC         0x52U    // EPWM6 Controller Access Control Register
#define SYSCTL_O_EPWM7_AC         0x54U    // EPWM7 Controller Access Control Register
#define SYSCTL_O_EPWM8_AC         0x56U    // EPWM8 Controller Access Control Register
#define SYSCTL_O_EPWM9_AC         0x58U    // EPWM9 Controller Access Control Register
#define SYSCTL_O_EPWM10_AC        0x5AU    // EPWM10 Controller Access Control Register
#define SYSCTL_O_EPWM11_AC        0x5CU    // EPWM11 Controller Access Control Register
#define SYSCTL_O_EPWM12_AC        0x5EU    // EPWM12 Controller Access Control Register
#define SYSCTL_O_EPWM13_AC        0x60U    // EPWM13 Controller Access Control Register
#define SYSCTL_O_EPWM14_AC        0x62U    // EPWM14 Controller Access Control Register
#define SYSCTL_O_EPWM15_AC        0x64U    // EPWM15 Controller Access Control Register
#define SYSCTL_O_EPWM16_AC        0x66U    // EPWM16 Controller Access Control Register
#define SYSCTL_O_EPWM17_AC        0x68U    // EPWM17 Controller Access Control Register
#define SYSCTL_O_EPWM18_AC        0x6AU    // EPWM18 Controller Access Control Register
#define SYSCTL_O_EQEP1_AC         0x70U    // EQEP1 Controller Access Control Register
#define SYSCTL_O_EQEP2_AC         0x72U    // EQEP2 Controller Access Control Register
#define SYSCTL_O_EQEP3_AC         0x74U    // EQEP3 Controller Access Control Register
#define SYSCTL_O_EQEP4_AC         0x76U    // EQEP4 Controller Access Control Register
#define SYSCTL_O_EQEP5_AC         0x78U    // EQEP5 Controller Access Control Register
#define SYSCTL_O_EQEP6_AC         0x7AU    // EQEP6 Controller Access Control Register
#define SYSCTL_O_ECAP1_AC         0x80U    // ECAP1 Controller Access Control Register
#define SYSCTL_O_ECAP2_AC         0x82U    // ECAP2 Controller Access Control Register
#define SYSCTL_O_ECAP3_AC         0x84U    // ECAP3 Controller Access Control Register
#define SYSCTL_O_ECAP4_AC         0x86U    // ECAP4 Controller Access Control Register
#define SYSCTL_O_ECAP5_AC         0x88U    // ECAP5 Controller Access Control Register
#define SYSCTL_O_ECAP6_AC         0x8AU    // ECAP6 Controller Access Control Register
#define SYSCTL_O_ECAP7_AC         0x8CU    // ECAP7 Controller Access Control Register
#define SYSCTL_O_SDFM1_AC         0xA8U    // SDFM1 Controller Access Control Register
#define SYSCTL_O_SDFM2_AC         0xAAU    // SDFM2 Controller Access Control Register
#define SYSCTL_O_SDFM3_AC         0xACU    // SDFM3 Controller Access Control Register
#define SYSCTL_O_SDFM4_AC         0xAEU    // SDFM4 Controller Access Control Register
#define SYSCTL_O_CLB1_AC          0xB0U    // CLB1 Controller Access Control Register
#define SYSCTL_O_CLB2_AC          0xB2U    // CLB2 Controller Access Control Register
#define SYSCTL_O_CLB3_AC          0xB4U    // CLB3 Controller Access Control Register
#define SYSCTL_O_CLB4_AC          0xB6U    // CLB4 Controller Access Control Register
#define SYSCTL_O_CLB5_AC          0xB8U    // CLB5 Controller Access Control Register
#define SYSCTL_O_CLB6_AC          0xBAU    // CLB6 Controller Access Control Register
#define SYSCTL_O_SCIA_AC          0x100U   // SCIA Controller Access Control Register
#define SYSCTL_O_SCIB_AC          0x102U   // SCIB Controller Access Control Register
#define SYSCTL_O_SPIA_AC          0x110U   // SPIA Controller Access Control Register
#define SYSCTL_O_SPIB_AC          0x112U   // SPIB Controller Access Control Register
#define SYSCTL_O_SPIC_AC          0x114U   // SPIC Controller Access Control Register
#define SYSCTL_O_SPID_AC          0x116U   // SPID Controller Access Control Register
#define SYSCTL_O_I2CA_AC          0x120U   // I2CA Controller Access Control Register
#define SYSCTL_O_I2CB_AC          0x122U   // I2CB Controller Access Control Register
#define SYSCTL_O_PMBUS_A_AC       0x130U   // PMBUSA Controller Access Control Register
#define SYSCTL_O_LIN_A_AC         0x138U   // LINA Controller Access Control Register
#define SYSCTL_O_LIN_B_AC         0x13AU   // LINB Controller Access Control Register
#define SYSCTL_O_DCANA_AC         0x140U   // DCANA Controller Access Control Register
#define SYSCTL_O_MCANA_AC         0x148U   // MCANA Controller Access Control Register
#define SYSCTL_O_MCANB_AC         0x14AU   // MCANB Controller Access Control Register
#define SYSCTL_O_FSIATX_AC        0x158U   // FSIA Controller Access Control Register
#define SYSCTL_O_FSIARX_AC        0x15AU   // FSIB Controller Access Control Register
#define SYSCTL_O_FSIBTX_AC        0x15CU   // FSIC Controller Access Control Register
#define SYSCTL_O_FSIBRX_AC        0x15EU   // FSID Controller Access Control Register
#define SYSCTL_O_FSICRX_AC        0x162U   // FSIB Controller Access Control Register
#define SYSCTL_O_FSIDRX_AC        0x166U   // FSID Controller Access Control Register
#define SYSCTL_O_USBA_AC          0x18AU   // USBA Controller Access Control Register
#define SYSCTL_O_HRPWM0_AC        0x1B2U   // HRPWM Controller Access Control Register
#define SYSCTL_O_HRPWM1_AC        0x1B4U   // HRPWM Controller Access Control Register
#define SYSCTL_O_HRPWM2_AC        0x1B6U   // HRPWM Controller Access Control Register
#define SYSCTL_O_ETHERCAT_AC      0x1B8U   // ETHERCAT Controller Access Control Register
#define SYSCTL_O_AESA_AC          0x1BCU   // AES Controller Access Control Register
#define SYSCTL_O_UARTA_AC         0x1BEU   // UART Controller Access Control Register
#define SYSCTL_O_UARTB_AC         0x1C0U   // UART Controller Access Control Register
#define SYSCTL_O_PERIPH_AC_LOCK   0x1FEU   // Lock Register to stop Write access to peripheral
                                           // Access register.

#define SYSCTL_O_SYNCSELECT         0x0U   // Sync Input and Output Select Register
#define SYSCTL_O_ADCSOCOUTSELECT    0x2U   // External ADCSOC Select Register (PWM1-16)
#define SYSCTL_O_ADCSOCOUTSELECT1   0x4U   // External ADCSOC Select Register (PWM17-32)
#define SYSCTL_O_SYNCSOCLOCK        0x6U   // SYNCSEL and EXTADCSOC Select Lock register

#define SYSCTL_O_LFUCONFIG            0x0U    // LFU configuration Register
#define SYSCTL_O_LFUSTATUS            0x2U    // LFU Configuration Status Register
#define SYSCTL_O_SWCONFIG1_SYSRSN     0x10U   // Spare registers reset by SYSRSn
#define SYSCTL_O_SWCONFIG2_SYSRSN     0x12U   // Spare registers reset by SYSRSn
#define SYSCTL_O_SWCONFIG1_XRSN       0x14U   // Spare registers reset by XRSn
#define SYSCTL_O_SWCONFIG2_XRSN       0x16U   // Spare registers reset by XRSn
#define SYSCTL_O_SWCONFIG1_PORESETN   0x18U   // Spare registers reset by PORESETn
#define SYSCTL_O_SWCONFIG2_PORESETN   0x1AU   // Spare registers reset by PORESETn
#define SYSCTL_O_LFU_LOCK             0x1CU   // LFU Lock Configuration
#define SYSCTL_O_LFU_COMMIT           0x1EU   // LFU Commit Configuration

#define SYSCTL_O_SYS_ERR_INT_FLG   0x10U   // Status of interrupts due to multiple different errors
                                           // in the system.
#define SYSCTL_O_SYS_ERR_INT_CLR   0x12U   // SYS_ERR_INT_FLG clear register
#define SYSCTL_O_SYS_ERR_INT_SET   0x14U   // SYS_ERR_INT_FLG set register
#define SYSCTL_O_SYS_ERR_MASK      0x16U   // SYS_ERR_MASK register
#define SYSCTL_O_LCM_ERR_FLG              0x18U   // Status register indicating lockstep compare
                                                  // error flag
#define SYSCTL_O_LCM_ERR_FLG_CLR          0x1AU   // LCM_ERR_FLG clear register
#define SYSCTL_O_LCM_ERR_FLG_SET          0x1CU   // LCM_ERR_FLG set register
#define SYSCTL_O_LCM_ERR_FLG_MASK         0x1EU   // LCM_ERR_FLG mask register
#define SYSCTL_O_REGPARITY_ERR_FLG        0x20U   // Status register indicating register parity
                                                  // error flag
#define SYSCTL_O_REGPARITY_ERR_FLG_CLR    0x22U   // REGPARITY_ERR_FLG clear register
#define SYSCTL_O_REGPARITY_ERR_FLG_SET    0x24U   // REGPARITY_ERR_FLG set register
#define SYSCTL_O_REGPARITY_ERR_FLG_MASK   0x26U   // REGPARITY_ERR_FLG mask register


//*************************************************************************************************
//
// The following are defines for the bit fields in the DEVCFGLOCK1 register
//
//*************************************************************************************************
#define SYSCTL_DEVCFGLOCK1_CPUSEL0    0x1U          // Lock bit for CPUSEL0 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL1    0x2U          // Lock bit for CPUSEL1 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL2    0x4U          // Lock bit for CPUSEL2 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL3    0x8U          // Lock bit for CPUSEL3 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL4    0x10U         // Lock bit for CPUSEL4 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL5    0x20U         // Lock bit for CPUSEL5 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL6    0x40U         // Lock bit for CPUSEL6 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL7    0x80U         // Lock bit for CPUSEL7 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL8    0x100U        // Lock bit for CPUSEL8 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL9    0x200U        // Lock bit for CPUSEL9 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL11   0x800U        // Lock bit for CPUSEL11 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL12   0x1000U       // Lock bit for CPUSEL12 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL13   0x2000U       // Lock bit for CPUSEL13 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL14   0x4000U       // Lock bit for CPUSEL14 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL15   0x8000U       // Lock bit for CPUSEL15 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL16   0x10000U      // Lock bit for CPUSEL16 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL17   0x20000U      // Lock bit for CPUSEL17 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL23   0x800000U     // Lock bit for CPUSEL23 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL25   0x2000000U    // Lock bit for CPUSEL25 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL26   0x4000000U    // Lock bit for CPUSEL26 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL27   0x8000000U    // Lock bit for CPUSEL27 register
#define SYSCTL_DEVCFGLOCK1_CPUSEL28   0x10000000U   // Lock bit for CPUSEL28 register

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEVCFGLOCK2 register
//
//*************************************************************************************************
#define SYSCTL_DEVCFGLOCK2_BANKMUXSEL   0x4U   // Flash Bank Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTIDL register
//
//*************************************************************************************************
#define SYSCTL_PARTIDL_QUAL_S         6U
#define SYSCTL_PARTIDL_QUAL_M         0xC0U       // Qualification Status
#define SYSCTL_PARTIDL_PIN_COUNT_S    8U
#define SYSCTL_PARTIDL_PIN_COUNT_M    0x700U      // Device Pin Count
#define SYSCTL_PARTIDL_FLASH_SIZE_S   16U
#define SYSCTL_PARTIDL_FLASH_SIZE_M   0xFF0000U   // FLASH_SIZE

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTIDH register
//
//*************************************************************************************************
#define SYSCTL_PARTIDH_FAMILY_S            8U
#define SYSCTL_PARTIDH_FAMILY_M            0xFF00U       // Device family
#define SYSCTL_PARTIDH_PARTNO_S            16U
#define SYSCTL_PARTIDH_PARTNO_M            0xFF0000U     // Device part number
#define SYSCTL_PARTIDH_DEVICE_CLASS_ID_S   24U
#define SYSCTL_PARTIDH_DEVICE_CLASS_ID_M   0xFF000000U   // Device class ID

//*************************************************************************************************
//
// The following are defines for the bit fields in the REVID register
//
//*************************************************************************************************
#define SYSCTL_REVID_REVID_S   0U
#define SYSCTL_REVID_REVID_M   0xFFFFU   // Device Revision ID. This is specific to the Device

//*************************************************************************************************
//
// The following are defines for the bit fields in the BANKMUXSEL register
//
//*************************************************************************************************
#define SYSCTL_BANKMUXSEL_BANK0_S   0U
#define SYSCTL_BANKMUXSEL_BANK0_M   0x3U     // Select Flash Bank Controller CPU for Read accesses
#define SYSCTL_BANKMUXSEL_BANK1_S   2U
#define SYSCTL_BANKMUXSEL_BANK1_M   0xCU     // Select Flash Bank Controller CPU for Read accesses
#define SYSCTL_BANKMUXSEL_BANK2_S   4U
#define SYSCTL_BANKMUXSEL_BANK2_M   0x30U    // Select Flash Bank Controller CPU for Read accesses
#define SYSCTL_BANKMUXSEL_BANK3_S   6U
#define SYSCTL_BANKMUXSEL_BANK3_M   0xC0U    // Select Flash Bank Controller CPU for Read accesses
#define SYSCTL_BANKMUXSEL_BANK4_S   8U
#define SYSCTL_BANKMUXSEL_BANK4_M   0x300U   // Select Flash Bank Controller CPU for Read accesses

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF0 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF0_DUAL_CORE   0x1U   // User Configurable Single Core vs Dual Core

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF1 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF1_MSEL_D2   0x4U    // Controller Select for MSEL_D2
#define SYSCTL_MCUCNF1_MSEL_D3   0x8U    // Controller Select for MSEL_D3
#define SYSCTL_MCUCNF1_MSEL_D4   0x10U   // Controller Select for MSEL_D4
#define SYSCTL_MCUCNF1_MSEL_D5   0x20U   // Controller Select for MSEL_D5

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF2 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF2_ETHERCAT   0x1U   // ETHERCAT

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF3 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF3_SECT15_0      0x1U    // Flash sectors 15_0 present
#define SYSCTL_MCUCNF3_SECT31_16     0x2U    // Flash sectors 31_16 present
#define SYSCTL_MCUCNF3_SECT47_32     0x4U    // Flash sectors 47_32 present
#define SYSCTL_MCUCNF3_SECT63_48     0x8U    // Flash sectors 63_48 present
#define SYSCTL_MCUCNF3_SECT79_64     0x10U   // Flash sectors 79_64 present
#define SYSCTL_MCUCNF3_SECT95_80     0x20U   // Flash sectors 95_80 present
#define SYSCTL_MCUCNF3_SECT111_96    0x40U   // Flash sectors 111_96 present
#define SYSCTL_MCUCNF3_SECT127_112   0x80U   // Flash sectors 127_112 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF4 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF4_SECT15_0      0x1U    // Flash sectors 15_0 present
#define SYSCTL_MCUCNF4_SECT31_16     0x2U    // Flash sectors 31_16 present
#define SYSCTL_MCUCNF4_SECT47_32     0x4U    // Flash sectors 47_32 present
#define SYSCTL_MCUCNF4_SECT63_48     0x8U    // Flash sectors 63_48 present
#define SYSCTL_MCUCNF4_SECT79_64     0x10U   // Flash sectors 79_64 present
#define SYSCTL_MCUCNF4_SECT95_80     0x20U   // Flash sectors 95_80 present
#define SYSCTL_MCUCNF4_SECT111_96    0x40U   // Flash sectors 111_96 present
#define SYSCTL_MCUCNF4_SECT127_112   0x80U   // Flash sectors 127_112 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF5 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF5_SECT15_0      0x1U    // Flash sectors 15_0 present
#define SYSCTL_MCUCNF5_SECT31_16     0x2U    // Flash sectors 31_16 present
#define SYSCTL_MCUCNF5_SECT47_32     0x4U    // Flash sectors 47_32 present
#define SYSCTL_MCUCNF5_SECT63_48     0x8U    // Flash sectors 63_48 present
#define SYSCTL_MCUCNF5_SECT79_64     0x10U   // Flash sectors 79_64 present
#define SYSCTL_MCUCNF5_SECT95_80     0x20U   // Flash sectors 95_80 present
#define SYSCTL_MCUCNF5_SECT111_96    0x40U   // Flash sectors 111_96 present
#define SYSCTL_MCUCNF5_SECT127_112   0x80U   // Flash sectors 127_112 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF6 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF6_SECT15_0      0x1U    // Flash sectors 15_0 present
#define SYSCTL_MCUCNF6_SECT31_16     0x2U    // Flash sectors 31_16 present
#define SYSCTL_MCUCNF6_SECT47_32     0x4U    // Flash sectors 47_32 present
#define SYSCTL_MCUCNF6_SECT63_48     0x8U    // Flash sectors 63_48 present
#define SYSCTL_MCUCNF6_SECT79_64     0x10U   // Flash sectors 79_64 present
#define SYSCTL_MCUCNF6_SECT95_80     0x20U   // Flash sectors 95_80 present
#define SYSCTL_MCUCNF6_SECT111_96    0x40U   // Flash sectors 111_96 present
#define SYSCTL_MCUCNF6_SECT127_112   0x80U   // Flash sectors 127_112 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF7 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF7_SECT15_0      0x1U    // Flash sectors 15_0 present
#define SYSCTL_MCUCNF7_SECT31_16     0x2U    // Flash sectors 31_16 present
#define SYSCTL_MCUCNF7_SECT47_32     0x4U    // Flash sectors 47_32 present
#define SYSCTL_MCUCNF7_SECT63_48     0x8U    // Flash sectors 63_48 present
#define SYSCTL_MCUCNF7_SECT79_64     0x10U   // Flash sectors 79_64 present
#define SYSCTL_MCUCNF7_SECT95_80     0x20U   // Flash sectors 95_80 present
#define SYSCTL_MCUCNF7_SECT111_96    0x40U   // Flash sectors 111_96 present
#define SYSCTL_MCUCNF7_SECT127_112   0x80U   // Flash sectors 127_112 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNFLOCK register
//
//*************************************************************************************************
#define SYSCTL_MCUCNFLOCK_MCUCNF0   0x1U    // Lock bit for MCUCNF0 register
#define SYSCTL_MCUCNFLOCK_MCUCNF1   0x2U    // Lock bit for MCUCNF1 register
#define SYSCTL_MCUCNFLOCK_MCUCNF2   0x4U    // Lock bit for MCUCNF2 register
#define SYSCTL_MCUCNFLOCK_MCUCNF3   0x8U    // Lock bit for MCUCNF3 register
#define SYSCTL_MCUCNFLOCK_MCUCNF4   0x10U   // Lock bit for MCUCNF4 register
#define SYSCTL_MCUCNFLOCK_MCUCNF5   0x20U   // Lock bit for MCUCNF5 register
#define SYSCTL_MCUCNFLOCK_MCUCNF6   0x40U   // Lock bit for MCUCNF6 register
#define SYSCTL_MCUCNFLOCK_MCUCNF7   0x80U   // Lock bit for MCUCNF7 register

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRIMERRSTS register
//
//*************************************************************************************************
#define SYSCTL_TRIMERRSTS_LERR_S   0U
#define SYSCTL_TRIMERRSTS_LERR_M   0xFFFFU   // TRIM Load error status

